LAutour/ESP32-HUB75-MatrixPanel-DMA-ICN2053/ESP32-HUB75-MatrixPanel-DMA-icn2053.cpp
#include <Arduino.h>
#include "ESP32-HUB75-MatrixPanel-DMA-icn2053.h"
#include "ESP32-HUB75-MatrixPanel-DMA-leddrivers.h"

#define SERIAL_DEBUG

#define offset_prefix  dma_buff.all_row_data_cnt
#define offset_suffix  (dma_buff.all_row_data_cnt + dma_buff.frame_prefix_cnt)
/***************************************************************************************/   

#ifndef NO_CIE1931
#endif

typedef struct {
  int16_t x;
  int16_t y;
}coords_t;

// Max clock cycles to blank OE before/after LAT signal change
//enum{CLKS_DURING_LATCH = 0};

//для callback обработчика
MatrixPanel_DMA* MatrixPanel = NULL;

//очистка буферов при неудачной инициализации 
void MatrixPanel_DMA::buffersFree()
{
  int i;
  if (dma_buff.rowBits != NULL)
  {
    i = dma_buff.all_row_data_cnt + dma_buff.frame_prefix_cnt + dma_buff.frame_suffix_cnt;
    while (i > 0)
    {
      i--;
      if (dma_buff.rowBits[i] != NULL)
      {
        heap_caps_free(dma_buff.rowBits[i]);
      }
    }
    heap_caps_free(dma_buff.rowBits);
  }
  for(i = m_cfg.double_buff-1; i >= 0; i--)
  {
    if(frame_buffer.frameBits[i] != NULL)
    {
      heap_caps_free(frame_buffer.frameBits[i]);
    }
  }
  if (dmadesc_data[0] != NULL)
  {
    heap_caps_free(dmadesc_data[0]);
  }
  if (brightness_table != NULL)
  {
    heap_caps_free(brightness_table);
  }

}

//---------------------------//
//  Функции вывода в панели  //
//---------------------------//

//получение цвета пиксела в фрейм-буфере
#ifdef USE_COLORx16
inline void MatrixPanel_DMA::getRGBColor16(int offset_y, int offset_x, rgb888_t& rgb888)
{
  uint16_t* addr = (uint16_t*)&frame_buffer.frameBits[back_buffer_id^m_cfg.double_buff][offset_y];
  color565to888(addr[offset_x], rgb888.r,rgb888.g, rgb888.b);
}
#endif

//подготовка DMA-буфера
IRAM_ATTR void MatrixPanel_DMA::prepareDmaRows(uint8_t row_offset, uint8_t dma_buff_id)
{
  rgb888_t pixel888_1;
  rgb888_t pixel888_2;
  driver_rgb_t pixel1;
  driver_rgb_t pixel2;

  if (icn2053_clear) return;

  row_offset = (rows_per_frame - row_offset) + scroll_y;// - dma_buff.row_data_cnt;// + scroll_y;
  //row_offset
  for(int row_buf_id = 0; row_buf_id < dma_buff.row_data_cnt; row_buf_id++)
  {
    //рулонный сдвиг по y
    if (row_offset >= rows_per_frame) row_offset -= rows_per_frame;
    ///смещение в строку видеобуфера
    int offset_y = row_offset*frame_buffer.row_len;

    //смещения для буфера вывода
    int dma_buff_offset = 0;//DRIVER_BITS;
    int  dma_buff_offset_next = 0;//DRIVER_BITS;
    int driver_idx = DRIVER_BITS;
    int offset_x;
    if (hw_mirror_x)
    {
      //рулонный сдвиг по x
      offset_x = pixels_per_row + scroll_x - 1;
      if (offset_x >= pixels_per_row) offset_x -= pixels_per_row;
    }else
    {
      //рулонный сдвиг по x
      offset_x = 0 - scroll_x;
      if (offset_x < 0 ) offset_x += pixels_per_row;    
    }
    //индекс строки в DMA буфере
    //дл одиночного буфера dma_buff_id = 0 
    int row_dma_offset = (dma_buff_id)?(row_buf_id + dma_buff.row_data_cnt):row_buf_id;

    int8_t color_bits = dma_buff.color_bits;
    for (int i = pixels_per_row; i > 0; i--)
    { 
      switch (color_bits)
      {
        #ifdef USE_COLORx16
        case -16:
          getRGBColor16(offset_y, offset_x, pixel888_1);
          getRGBColor16(offset_y + (frame_buffer.subframe_len >> 1), offset_x, pixel888_2);
        break;
        #endif
        default:
          if (getUserRGB != NULL) getUserRGB(row_offset, offset_x, pixel888_1, pixel888_2);
        break;
      }

      if (negative_panel) 
      {
        pixel888_1.r = ~pixel888_1.r;
        pixel888_1.g = ~pixel888_1.g;
        pixel888_1.b = ~pixel888_1.b;
        pixel888_2.r = ~pixel888_2.r;
        pixel888_2.g = ~pixel888_2.g;
        pixel888_2.b = ~pixel888_2.b;
      }

      pixel1.r = brightness_table[pixel888_1.r];
      pixel1.g = brightness_table[pixel888_1.g];  
      pixel1.b = brightness_table[pixel888_1.b];  
      pixel2.r = brightness_table[pixel888_2.r];
      pixel2.g = brightness_table[pixel888_2.g];  
      pixel2.b = brightness_table[pixel888_2.b];  

      //вывод пиксела в видеобуфер
      ESP32_I2S_DMA_STORAGE_TYPE mask_rgb12;
      for (int j = DRIVER_BITS-1; j >= 0; j--)
      {
        mask_rgb12 = 0;
        if (pixel1.r < 0) mask_rgb12 |= BIT_R1; pixel1.r <<= 1;
        if (pixel1.g < 0) mask_rgb12 |= BIT_G1; pixel1.g <<= 1;
        if (pixel1.b < 0) mask_rgb12 |= BIT_B1; pixel1.b <<= 1;
        if (pixel2.r < 0) mask_rgb12 |= BIT_R2; pixel2.r <<= 1;
        if (pixel2.g < 0) mask_rgb12 |= BIT_G2; pixel2.g <<= 1;
        if (pixel2.b < 0) mask_rgb12 |= BIT_B2; pixel2.b <<= 1;

        int offset_dma = dma_buff_offset ^ 1;        
        dma_buff.rowBits[row_dma_offset][offset_dma] = (dma_buff.rowBits[row_dma_offset][offset_dma] & (~BITMASK_RGB12))|mask_rgb12;
        dma_buff_offset++;
      }
      driver_idx--;
      if (driver_idx == 0)
      {
        driver_idx = DRIVER_BITS;
        dma_buff_offset_next += DRIVER_BITS; 
        dma_buff_offset = dma_buff_offset_next;
      }else
      {
        dma_buff_offset += pixels_per_row + SUBROW_ADD_LEN - DRIVER_BITS;  
      }
      if (hw_mirror_x)
      {
        if (offset_x == 0) offset_x = pixels_per_row - 1;
        else offset_x--;
      }else
      {
        offset_x++;
        if (pixels_per_row == 0) offset_x = 0;
      }
    }
    row_offset++;
  }
}

//выключить вывод драйверов панели
void MatrixPanel_DMA::panelShowOff()
{
  if (m_cfg.driver == ICN2053)
  {
    //можно проще, но тогда нужно городить еще DMA буфер и переключение на него только для одной команды
    waitDmaReady();
    icn2053setVSync(false, false);
    sendVsync();
    waitDmaReady();
    icn2053setVSync(false, true);
  }else
  {
    //shift
  }
}

//включить вывод драйеров панели
void MatrixPanel_DMA::panelShowOn()
{
  if (m_cfg.driver == ICN2053)
  {
    //можно проще, но тогда нужно городить еще DMA буфер и переключение на него только для одной команды
    waitDmaReady();
    icn2053setVSync(true, false);
    sendVsync();
    waitDmaReady();
    icn2053setVSync(true, true);    
  }else
  {
    //shift
  }
}

//подготовка префикса и переключение DMA вывода
IRAM_ATTR void MatrixPanel_DMA::sendCBVsync()
{
  icn2053setReg(driver_cur_reg, (&driver_reg[driver_cur_reg]));
  driver_cur_reg++;
  if (driver_cur_reg >= ICN2053_REG_CNT) driver_cur_reg = 0;

