LAutour/ESP32-HUB75-MatrixPanel-DMA-ICN2053/ESP32-HUB75-MatrixPanel-DMA-icn2053.cpp
  if (m_cfg.driver == ICN2053)
  {
    #ifdef SERIAL_DEBUG  
    Serial.println("configureDMA(): Link dmadesc_suffix 2.");
    #endif       
    linkDmaDesc_n(dmadesc_suffix[1], NULL, desc_suffix_cnt, 
      (uint8_t**)&dma_buff.rowBits[offset_suffix], dma_buff.frame_suffix_len*SIZE_DMA_TYPE,DMA_MAX, 1);  
    for(int i = ICN2053_DESCEXT_CNT-1; i >= 0; i--)
    {
      //только для инициализации всех полей дескрипторов
      link_dma_desc(&dmadesc_ext[i], NULL, NULL, 0);
    }
    //подготовка регистров конфигурации
    driver_reg = (driver_rgb_t*)heap_caps_calloc(ICN2053_REG_CNT, sizeof(driver_rgb_t), MALLOC_CAP_8BIT);
    if (driver_reg == NULL)
    {
      buffersFree();
      return;
    }
    memcpy(driver_reg, ICN2053_REG_VALUE, ICN2053_REG_CNT*sizeof(driver_rgb_t));
    setDriverRegRGB(&driver_reg[ICN2053_CFG1], (rows_per_frame-1), ICN2053_CFG1_LC_MASK, ICN2053_CFG1_LC_OFFSET);
    icn2053initBuffers(); 
    bufferReady = false;
    bufferBusy = false;
    icn2053_clear = false;
    icn2053_auto_vsync = false;
    getUserRGB = NULL;
    drawUserPixel = NULL;
    driver_cur_reg = 0;
    cur_suffix_id = 0;
    rows_send_cnt = 0;
    dma_int_cnt = 0;
  }else
  {
    //shift
  }
  #ifdef SERIAL_DEBUG  
  Serial.println(F("configureDMA(): Inited buffers.\r\n"));
  #endif       

  //End markers for DMA LL

  #ifdef SERIAL_DEBUG
  Serial.println(F("Performing I2S setup:"));
  #endif

  i2s_parallel_config_t cfg = 
  {
    .gpio_bus = {
      m_cfg.gpio.r1, m_cfg.gpio.g1, m_cfg.gpio.b1, 
      m_cfg.gpio.r2, m_cfg.gpio.g2, m_cfg.gpio.b2, 
      m_cfg.gpio.lat, m_cfg.gpio.oe, 
      m_cfg.gpio.a, m_cfg.gpio.b, m_cfg.gpio.c, m_cfg.gpio.d, m_cfg.gpio.e, 
      -1, -1, -1},
    .gpio_clk = m_cfg.gpio.clk,
    .sample_rate = m_cfg.clk_freq,   
    .sample_width = ESP32_I2S_DMA_MODE,        
    .desccount_a = desc_data_cnt, //использовать только для SHIFT драйверов
    .lldesc_a = dmadesc_data[0],  //      
    .desccount_b = desc_data_cnt, //использовать только для SHIFT драйверов
    .lldesc_b = dmadesc_data[1],  //использовать только для SHIFT драйверов
    .clkphase = m_cfg.clk_phase
  };

  //для Call обработчика DMA  
  MatrixPanel = this;
  // Setup I2S 
  esp_err_t res = i2s_parallel_driver_install(I2S_NUM_1, &cfg);
  if (res != ESP_OK)
  {
    #ifdef SERIAL_DEBUG
    Serial.println("Error setup I2S");  
    #endif
    buffersFree();
    return;
  }
  negative_panel = false;
  scroll_y = 0;
  scroll_x = 0;
  CurColor = 0;
  CurRGB.r = 0;
  CurRGB.g = 0;
  CurRGB.b = 0;

  #ifdef SERIAL_DEBUG
  Serial.println(F("Installed."));
  #endif
  initialized = true;	
  if (m_cfg.driver == ICN2053)
  {
    setShiftCompleteCallback(&icn2053i2sCallback);
    i2s_parallel_send_dma(I2S_NUM_1, dmadesc_suffix[0]);    
    icn2053init();  
  }else
  {
    return;
    //shift
  }

  #ifdef SERIAL_DEBUG  
  Serial.println(F("configureDMA(): DMA setup completed on I2S1.")); 
  #endif         
  initialized = true;	  
  setPanelBrightness(brightness);
} // end initMatrixDMABuff



bool MatrixPanel_DMA::begin()
{
  // Change 'if' to '1' to enable, 0 to not include this Serial output in compiled program        
  #ifdef SERIAL_DEBUG       
  Serial.printf_P(PSTR("Using pin %d for the R1_PIN\n"), m_cfg.gpio.r1);
  Serial.printf_P(PSTR("Using pin %d for the G1_PIN\n"), m_cfg.gpio.g1);
  Serial.printf_P(PSTR("Using pin %d for the B1_PIN\n"), m_cfg.gpio.b1);
  Serial.printf_P(PSTR("Using pin %d for the R2_PIN\n"), m_cfg.gpio.r2);
  Serial.printf_P(PSTR("Using pin %d for the G2_PIN\n"), m_cfg.gpio.g2);
  Serial.printf_P(PSTR("Using pin %d for the B2_PIN\n"), m_cfg.gpio.b2);
  Serial.printf_P(PSTR("Using pin %d for the A_PIN\n"), m_cfg.gpio.a);
  Serial.printf_P(PSTR("Using pin %d for the B_PIN\n"), m_cfg.gpio.b);
  Serial.printf_P(PSTR("Using pin %d for the C_PIN\n"), m_cfg.gpio.c);
  Serial.printf_P(PSTR("Using pin %d for the D_PIN\n"), m_cfg.gpio.d);
  Serial.printf_P(PSTR("Using pin %d for the E_PIN\n"), m_cfg.gpio.e);
  Serial.printf_P(PSTR("Using pin %d for the LAT_PIN\n"), m_cfg.gpio.lat);
  Serial.printf_P(PSTR("Using pin %d for the OE_PIN\n"),  m_cfg.gpio.oe);
  Serial.printf_P(PSTR("Using pin %d for the CLK_PIN\n"), m_cfg.gpio.clk);
  #endif   

  pixels_per_row = m_cfg.mx_width*m_cfg.mx_count_width*m_cfg.mx_count_height;
  rows_per_frame = m_cfg.mx_height/ROWS_IN_PARALLEL;
  driver_cnt = pixels_per_row/DRIVER_BITS;
  brightness = BRIGHTNESS_DEFAULT;

  if (PANEL_COUNT_Y <= 1) virtual_draw = 0;
  if (virtual_draw)
  {
    serpentine_chain = (virtual_draw & _VIRTUAL_BIT_SERPENTINE) != 0;  
    top_down_chain = (virtual_draw & _VIRTUAL_BIT_TOP_DOWN) != 0;
  }else
  {
    serpentine_chain = false;
    top_down_chain = true;
  }
  setRotation(0);
  setMirrorX(false);
  setMirrorY(false);
  Serial.println(mirror_x);
  Serial.println(mirror_y);

  /* As DMA buffers are dynamically allocated, we must allocated in begin()
  * Ref: https://github.com/espressif/arduino-esp32/issues/831
  */
  if ( !allocateDMAmemory() ) 
  {  
    return false; 
  } // couldn't even get the basic ram required.

  // Flush the DMA buffers prior to configuring DMA - Avoid visual artefacts on boot.
  //clearScreen(); // Must fill the DMA buffer with the initial output bit sequence or the panel will display garbage
  // Setup the ESP32 DMA Engine. Sprite_TM built this stuff.
  configureDMA(); //DMA and I2S configuration and setup

  #ifdef SERIAL_DEBUG 
  if (!initialized)    
    Serial.println(F("MatrixPanel_DMA::begin() failed."));
  #endif      

  return initialized;
}

//overload for compatibility
bool MatrixPanel_DMA::begin(hub75_pins_t* hub75_pins_ptr)
{
  // RGB
  memcpy(&m_cfg.gpio, hub75_pins_ptr, sizeof(hub75_pins_t));
  return begin();
}

MatrixPanel_DMA::MatrixPanel_DMA(virtual_matrix_t _virtual_panel):
  #if defined(USE_GFX_ROOT)
  GFX(MATRIX_WIDTH, MATRIX_HEIGHT)
  #elif !defined(NO_GFX)
  Adafruit_GFX((PANEL_COUNT_Y > 1)?(PANEL_WIDTH*PANEL_COUNT_X):(PANEL_WIDTH*PANEL_COUNT_X*PANEL_COUNT_Y), 
  (PANEL_COUNT_Y > 1)?(PANEL_HEIGHT*PANEL_COUNT_Y):(PANEL_HEIGHT))
  #endif
{
  memcpy(&m_cfg, &hub75_cfg_default, sizeof(hub75_cfg_t));
  initialized = false;
  virtual_draw = _virtual_panel;
}

//MatrixPanel_DMA 
//@param  {HUB75_I2S_CFG} opts : structure with matrix configuration
MatrixPanel_DMA::MatrixPanel_DMA(const hub75_cfg_t& opts, virtual_matrix_t _virtual_panel):
  #if defined(USE_GFX_ROOT) 
  GFX(opts.mx_width*opts.chain_length, opts.mx_height),
  #elif !defined(NO_GFX)
  Adafruit_GFX((PANEL_COUNT_Y > 1)?(opts.mx_width*opts.mx_count_width):(opts.mx_width*opts.mx_count_width*opts.mx_count_height), 
               (PANEL_COUNT_Y > 1)?(opts.mx_height*opts.mx_count_height):(opts.mx_height)),
  #endif        
  m_cfg(opts)
{    
  initialized = false;
  virtual_draw = _virtual_panel;
}


//---------------------------------//
//  Функции управления             //
//---------------------------------//

//очистить DMA буфер
void MatrixPanel_DMA::clearDmaBuffer(uint8_t _buff_id)
{
  int y_max, y_min;
  _buff_id &= m_cfg.double_dma_buff;
  if (_buff_id) 
  {
    y_max = dma_buff.all_row_data_cnt - 1; 
    y_min = dma_buff.all_row_data_cnt >> 1;
  }else 
  {
    y_max = (dma_buff.all_row_data_cnt >> 1) - 1; 
    y_min = 0;
  }
  for (int y = y_max; y >= y_min; y--)
  {
    for (int x = dma_buff.row_data_len - 1; x >= 0; x--)
    {
      dma_buff.rowBits[y][x] &= ~BITMASK_RGB12;
    }
  }
}

//очистить фрейм буфер
void MatrixPanel_DMA::clearBuffer(uint8_t _buff_id)
{  
  _buff_id &= 1;
  uint8_t clear_buff_idx = m_cfg.double_buff & (back_buffer_id^_buff_id^1);
  if (frame_buffer.len != 0)
  {    
    if (initialized &(_buff_id == 0))
    {
      panelShowOff();
      //запускаем очистку первого фрейма в памяти драйверов экрана
      waitDmaReady();
      icn2053_clear = true;
      sendFrame();
    }
    if (!m_cfg.double_buff)
      waitDmaReady();
    //очистка первичного видеобуфер параллельно с DMA очисткой драйверов экрана
    if (frame_buffer.frameBits[clear_buff_idx] != NULL)
      memset((uint8_t*)frame_buffer.frameBits[clear_buff_idx], 0, frame_buffer.len * VB_SIZE);
    if (initialized &(_buff_id == 0))
    {      
      //запускаем очистку второго фрейма в памяти драйверов экрана
      waitDmaReady();
      icn2053_clear = true;
      sendFrame();
      panelShowOn();
    }    
  }else
  {
    //shift
    //clearDmaBuffer(clear_buff_idx);
  }
}

//получить конфигурацию
const hub75_cfg_t& MatrixPanel_DMA::getCfg() const 
{
  return m_cfg;
};

//остановить DMA
void MatrixPanel_DMA::stopDMAoutput() 
{  
  clearScreen();
  i2s_parallel_stop_dma(I2S_NUM_1);
} 

//переключить DMA буфер
IRAM_ATTR void MatrixPanel_DMA::flipBuffer() 
{         
  if (!m_cfg.double_buff)
  {
    if (frame_buffer.len != 0) sendFrame();
  }else
  {
    #ifdef SERIAL_DEBUG     
    //Serial.printf_P(PSTR("Set show buffer to: %d\n"), back_buffer_id);
    #endif      
    if (frame_buffer.len != 0)
    {
      //waitDmaReady();
      waitDmaReady();
      back_buffer_id ^= 1;
      sendFrame();
    }else
    {
      //shift
    }
  }      
}

//переключить DMA буфер
IRAM_ATTR void MatrixPanel_DMA::flipDMABuffer() 
{
  flipBuffer();
}


void MatrixPanel_DMA::setDMAGetUserRGB(getUserRGB_p _getUserRGB)
{
  getUserRGB = _getUserRGB;
}

void MatrixPanel_DMA::setDrawUserPixel(drawUserPixel_p _drawUserPixel)
{
  drawUserPixel = _drawUserPixel;
}




